experiments/wrk2/wrk2-16/out.txt
Running 1m test @ http://192.168.1.2
  8 threads and 100 connections
  Thread calibration: mean lat.: 1586.726ms, rate sampling interval: 5500ms
  Thread calibration: mean lat.: 1601.660ms, rate sampling interval: 5607ms
  Thread calibration: mean lat.: 1622.183ms, rate sampling interval: 5771ms
  Thread calibration: mean lat.: 1552.988ms, rate sampling interval: 5591ms
  Thread calibration: mean lat.: 1577.212ms, rate sampling interval: 5615ms
  Thread calibration: mean lat.: 1569.322ms, rate sampling interval: 5615ms
  Thread calibration: mean lat.: 1564.001ms, rate sampling interval: 5623ms
  Thread calibration: mean lat.: 1581.397ms, rate sampling interval: 5648ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.83s     4.45s   19.53s    57.88%
    Req/Sec    22.13k   179.59    22.45k    63.08%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   10.83s 
 75.000%   14.69s 
 90.000%   17.01s 
 99.000%   18.51s 
 99.900%   19.04s 
 99.990%   19.45s 
 99.999%   19.55s 
100.000%   19.55s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    2775.039     0.000000           14         1.00
    4665.343     0.100000       886123         1.11
    6217.727     0.200000      1770141         1.25
    7753.727     0.300000      2654544         1.43
    9297.919     0.400000      3540002         1.67
   10829.823     0.500000      4420844         2.00
   11599.871     0.550000      4865536         2.22
   12361.727     0.600000      5308126         2.50
   13131.775     0.650000      5748002         2.86
   13910.015     0.700000      6189590         3.33
   14688.255     0.750000      6633438         4.00
   15073.279     0.775000      6853923         4.44
   15450.111     0.800000      7073842         5.00
   15843.327     0.825000      7297678         5.71
   16228.351     0.850000      7516880         6.67
   16613.375     0.875000      7737119         8.00
   16809.983     0.887500      7848741         8.89
   17006.591     0.900000      7961436        10.00
   17203.199     0.912500      8074470        11.43
   17383.423     0.925000      8183554        13.33
   17563.647     0.937500      8288590        16.00
   17678.335     0.943750      8352122        17.78
   17776.639     0.950000      8405468        20.00
   17874.943     0.956250      8459457        22.86
   17973.247     0.962500      8513439        26.67
   18071.551     0.968750      8565163        32.00
   18137.087     0.971875      8597621        35.56
   18202.623     0.975000      8626994        40.00
   18251.775     0.978125      8651208        45.71
   18317.311     0.981250      8680719        53.33
   18382.847     0.984375      8708964        64.00
   18415.615     0.985938      8721201        71.11
   18448.383     0.987500      8733569        80.00
   18481.151     0.989062      8746194        91.43
   18530.303     0.990625      8762475       106.67
   18563.071     0.992188      8772801       128.00
   18595.839     0.992969      8781443       142.22
   18612.223     0.993750      8785410       160.00
   18644.991     0.994531      8792287       182.86
   18694.143     0.995313      8800962       213.33
   18726.911     0.996094      8807299       256.00
   18743.295     0.996484      8810120       284.44
   18776.063     0.996875      8815086       320.00
   18792.447     0.997266      8816674       365.71
   18825.215     0.997656      8819885       426.67
   18890.751     0.998047      8824073       512.00
   18907.135     0.998242      8825286       568.89
   18939.903     0.998437      8827853       640.00
   18956.287     0.998633      8829118       731.43
   18989.055     0.998828      8830276       853.33
   19054.591     0.999023      8832875      1024.00
   19054.591     0.999121      8832875      1137.78
   19087.359     0.999219      8834074      1280.00
   19103.743     0.999316      8834642      1462.86
   19136.511     0.999414      8835782      1706.67
   19152.895     0.999512      8836342      2048.00
   19169.279     0.999561      8836928      2275.56
   19185.663     0.999609      8837190      2560.00
   19218.431     0.999658      8837602      2925.71
   19251.199     0.999707      8838220      3413.33
   19283.967     0.999756      8838476      4096.00
   19316.735     0.999780      8838654      4551.11
   19349.503     0.999805      8838934      5120.00
   19365.887     0.999829      8839123      5851.43
   19398.655     0.999854      8839379      6826.67
   19431.423     0.999878      8839693      8192.00
   19431.423     0.999890      8839693      9102.22
   19447.807     0.999902      8839754     10240.00
   19464.191     0.999915      8839878     11702.86
   19480.575     0.999927      8840028     13653.33
   19496.959     0.999939      8840077     16384.00
   19513.343     0.999945      8840247     18204.44
   19513.343     0.999951      8840247     20480.00
   19513.343     0.999957      8840247     23405.71
   19529.727     0.999963      8840484     27306.67
   19529.727     0.999969      8840484     32768.00
   19529.727     0.999973      8840484     36408.89
   19529.727     0.999976      8840484     40960.00
   19529.727     0.999979      8840484     46811.43
   19529.727     0.999982      8840484     54613.33
   19529.727     0.999985      8840484     65536.00
   19529.727     0.999986      8840484     72817.78
   19529.727     0.999988      8840484     81920.00
   19546.111     0.999989      8840580     93622.86
   19546.111     1.000000      8840580          inf
#[Mean    =    10832.250, StdDeviation   =     4454.815]
#[Max     =    19529.728, Total count    =      8840580]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%  471.00us
 75.000%  661.00us
 90.000%  737.00us
 99.000%    1.12ms
 99.900%    1.47ms
 99.990%    5.07ms
 99.999%   12.35ms
100.000%   22.19ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.076     0.000000            1         1.00
       0.315     0.100000       888741         1.11
       0.422     0.200000      1775573         1.25
       0.440     0.300000      2659889         1.43
       0.455     0.400000      3581803         1.67
       0.471     0.500000      4458697         2.00
       0.481     0.550000      4868585         2.22
       0.498     0.600000      5321129         2.50
       0.541     0.650000      5748088         2.86
       0.637     0.700000      6197990         3.33
       0.661     0.750000      6642178         4.00
       0.671     0.775000      6874709         4.44
       0.680     0.800000      7088071         5.00
       0.690     0.825000      7314688         5.71
       0.700     0.850000      7515009         6.67
       0.714     0.875000      7738215         8.00
       0.724     0.887500      7855062         8.89
       0.737     0.900000      7962839        10.00
       0.760     0.912500      8068886        11.43
       0.830     0.925000      8177607        13.33
       0.872     0.937500      8288710        16.00
       0.885     0.943750      8343700        17.78
       0.897     0.950000      8399171        20.00
       0.909     0.956250      8455316        22.86
       0.922     0.962500      8511940        26.67
       0.937     0.968750      8567433        32.00
       0.946     0.971875      8594590        35.56
       0.957     0.975000      8621588        40.00
       0.972     0.978125      8648266        45.71
       0.998     0.981250      8675556        53.33
       1.055     0.984375      8702753        64.00
       1.080     0.985938      8716532        71.11
       1.099     0.987500      8730361        80.00
       1.116     0.989062      8744707        91.43
       1.131     0.990625      8757914       106.67
       1.148     0.992188      8771933       128.00
       1.157     0.992969      8778643       142.22
       1.168     0.993750      8785803       160.00
       1.180     0.994531      8792531       182.86
       1.196     0.995313      8799380       213.33
       1.220     0.996094      8806216       256.00
       1.239     0.996484      8809535       284.44
       1.268     0.996875      8812986       320.00
       1.302     0.997266      8816474       365.71
       1.331     0.997656      8819885       426.67
       1.359     0.998047      8823427       512.00
       1.373     0.998242      8825089       568.89
       1.389     0.998437      8826852       640.00
       1.408     0.998633      8828555       731.43
       1.432     0.998828      8830279       853.33
       1.475     0.999023      8831971      1024.00
       1.509     0.999121      8832831      1137.78
       1.548     0.999219      8833685      1280.00
       1.588     0.999316      8834551      1462.86
       1.647     0.999414      8835402      1706.67
       1.800     0.999512      8836264      2048.00
       2.042     0.999561      8836695      2275.56
       2.575     0.999609      8837128      2560.00
       3.197     0.999658      8837559      2925.71
       3.799     0.999707      8837991      3413.33
       4.331     0.999756      8838429      4096.00
       4.419     0.999780      8838641      4551.11
       4.495     0.999805      8838861      5120.00
       4.583     0.999829      8839071      5851.43
       4.679     0.999854      8839288      6826.67
       4.831     0.999878      8839503      8192.00
       4.963     0.999890      8839612      9102.22
       5.115     0.999902      8839718     10240.00
       5.503     0.999915      8839825     11702.86
       6.407     0.999927      8839933     13653.33
       7.679     0.999939      8840041     16384.00
       8.123     0.999945      8840095     18204.44
       8.351     0.999951      8840151     20480.00
       8.471     0.999957      8840204     23405.71
       8.655     0.999963      8840258     27306.67
       8.831     0.999969      8840312     32768.00
       9.023     0.999973      8840338     36408.89
       9.583     0.999976      8840365     40960.00
      10.503     0.999979      8840393     46811.43
      11.135     0.999982      8840420     54613.33
      11.511     0.999985      8840446     65536.00
      11.879     0.999986      8840459     72817.78
      12.167     0.999988      8840473     81920.00
      12.327     0.999989      8840487     93622.86
      12.415     0.999991      8840500    109226.67
      12.607     0.999992      8840513    131072.00
      12.679     0.999993      8840520    145635.56
      12.927     0.999994      8840527    163840.00
      13.495     0.999995      8840533    187245.71
      15.247     0.999995      8840540    218453.33
      15.639     0.999996      8840547    262144.00
      15.727     0.999997      8840550    291271.11
      15.879     0.999997      8840554    327680.00
      15.943     0.999997      8840558    374491.43
      16.199     0.999998      8840560    436906.67
      16.295     0.999998      8840564    524288.00
      16.303     0.999998      8840565    582542.22
      16.399     0.999998      8840567    655360.00
      16.479     0.999999      8840569    748982.86
      16.527     0.999999      8840570    873813.33
      17.007     0.999999      8840572   1048576.00
      17.311     0.999999      8840573   1165084.44
      17.439     0.999999      8840574   1310720.00
      17.567     0.999999      8840575   1497965.71
      17.567     0.999999      8840575   1747626.67
      17.711     1.000000      8840576   2097152.00
      21.663     1.000000      8840577   2330168.89
      21.663     1.000000      8840577   2621440.00
      21.775     1.000000      8840578   2995931.43
      21.775     1.000000      8840578   3495253.33
      21.775     1.000000      8840578   4194304.00
      21.823     1.000000      8840579   4660337.78
      21.823     1.000000      8840579   5242880.00
      21.823     1.000000      8840579   5991862.86
      21.823     1.000000      8840579   6990506.67
      21.823     1.000000      8840579   8388608.00
      22.191     1.000000      8840580   9320675.55
      22.191     1.000000      8840580          inf
#[Mean    =        0.535, StdDeviation   =        0.210]
#[Max     =       22.176, Total count    =      8840580]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  10608148 requests in 1.00m, 8.49GB read
Requests/sec: 176805.78
Transfer/sec:    144.83MB